{
    "shortDescriptions": [
        "Command (shortcut)      Description",
        "",
        "list (l)                Lists all available commands.",
        "help (h)                Displays help for a specified command.",
        "quit (x)                Exits Tagged Music CLI.",
        "now-playing (p)         Control and modify the currently playing song.",
        "queue (q)               Manage the queue of currently playing songs.",
        "volume (v)              Print or set the current volume.",
        "library-provider (lp)   Push or pull libraries from the loaded library provider and modify its settings.",
        "song-provider (sp)      Add, remove, or check songs on the loaded song provider and modify its settings.",
        "songs (s)               Search, create, remove, and modify songs in the currently loaded library.",
        "tags (t)                Search, create, remove, and modify tags in the currently loaded library.",
        "tag-types (tt)          Search, create, remove, and modify tag types in the currently loaded library."
    ],
    "fullDescriptions": {
        "list": [
            "Usage: list",
            "Lists all available commands."
        ],
        "help": [
            "Usage: help [command]",
            "Displays help for the specified command."
        ],
        "quit": [
            "Usage: quit",
            "Exits Tagged Music CLI"
        ],
        "now-playing": [
            "Usage:",
            "    now-playing                         Prints a summary of the song that is currently playing.",
            "    now-playing [play/pause]            Plays or pauses the current song.",
            "    now-playing jump [MM:SS]            Jumps to the song to the specified time.",
            "    now-playing info                    Prints all of the song's properties",
            "    now-playing modify                  Modify the song's file name, artist, album, track number, year, and tags.",
            "",
            "Shortcuts:",
            "    play/pause  p",
            "    jump        j",
            "    info        i",
            "    modify      m"
        ],
        "queue": [
            "Usage:",
            "    queue                               Prints a summary of the currently playing queue.",
            "    queue list                          Lists all the songs in the queue ten at a time starting at the currently playing song. Enter \"p\" to view the previous ten or \"x\" to leave the command.",
            "    queue index <index>                 If <index> is specified, the currently playing song is changed to the one with that index, otherwise the currently playing song index is printed.",
            "    queue sort [sort] <reverse>         Sorts the queue by the sort by arguments provided. Sort by options include: shuffle, duration, album, track-number, year, last-modified, play-count. Include <reverse> if you want the ordering of the queue to be reversed.",
            "    queue filter                        Adds songs to the queue from the loaded library based on two sets of tags. The first set ",
            "    queue tag [tag...]                  Tags all the songs in the queue with the specified tags.",
            "    queue add [file name...]            Adds the specified song to the end of the queue.",
            "    queue remove [file name...]         Removes the specified songs from the queue.",
            "",
            "Shortcuts:",
            "    list        l",
            "    index       i",
            "    sort        s",
            "    filter      f",
            "    tag         t",
            "    add         a",
            "    remove      r"
        ],
        "volume": [
            "Usage: volume <value>",
            "If <value> is specified and in the range 0-100, the volume is set to that value. When <value> is not specified, the current volume is printed."
        ],
        "library-provider": [
            "Usage:",
            "    library-provider                    Prints a summary of the loaded library provider.",
            "    library-provider new                Runs a wizard to create and load a new library provider.",
            "    library-provider push               Pushes the loaded library to the loaded library provider.",
            "    library-provider pull               Pulls the library from the provider and loads it.",
            "    library-provider modify             Modify any provider specific settings.",
            "",
            "The library provider is used to store a file that contains all the information about a library. By pushing to the library provider, the previously pushed library is updated and can be retrieved again using pull.",
            "",
            "Shortcuts",
            "    new         n",
            "    push        s",
            "    pull        l",
            "    modify      m"
        ],
        "song-provider": [
            "Usage:",
            "    song-provider                       Prints a summary of the loaded song provider.",
            "    song-provider new                   Runs a wizard to create and load a new song provider.",
            "    song-provider has [file name]       Checks if the loaded song provider has the song available to pull.",
            "    song-provider push [song path]      Pushes the song file to the provider to be retrieved later.",
            "    song-provider remove [file name]    Removes the song from the provider.",
            "    song-provider modify                Modify any provider specific settings.",
            "",
            "The song provider is used to store all songs in a library in one place. When a song is played, the song file must first be pulled from the song provider by its file name identifier.",
            "",
            "Shortcuts:",
            "    new         n",
            "    has         h",
            "    push        s",
            "    remove      r",
            "    modify      m"
        ],
        "songs": [
            "Usage:",
            "    songs                               Prints a summary of all the songs in the library.",
            "    songs new                           Runs a wizard that creates a new song and adds it to the library.",
            "    songs info [file name]              Prints all of the specified song's properties",
            "    songs search [property] <text>      Returns a list of songs that contain the specified text within the specified property. Searchable properties include: file-name, title, artist, and album.",
            "    songs list                          Lists all the songs in the library ten at a time. Enter \"p\" to view the previous ten or \"x\" to leave the command.",
            "    songs modify [file name]            Modify the specified song's file name, artist, album, track number, year, and tags.",
            "    songs remove [file name]            Removes the specified song from the library.",
            "",
            "Shortcuts:",
            "    new         n",
            "    info        i",
            "    search      s",
            "    list        l",
            "    modify      m",
            "    remove      r"
        ],
        "tags": [
            "Usage:",
            "    tags                                Prints a summary of all the tags in the library.",
            "    tags new                            Runs a wizard that creates a new tag and adds it to the library.",
            "    tags info [name]                    Prints all of the specified tag's properties",
            "    tags search [property] <text>       Returns a list of tags that contain the specified text within the specified property. Searchable properties include: name, type and description.",
            "    tags list                           Lists all the tags in the library ten at a time. Enter \"p\" to view the previous ten or \"x\" to leave the command.",
            "    tags modify [name]                  Modify the specified tags's name, type and description.",
            "    tags remove [name]                  Removes the specified tag from the library.",
            "",
            "Shortcuts:",
            "    new         n",
            "    info        i",
            "    search      s",
            "    list        l",
            "    modify      m",
            "    remove      r"
        ],
        "tag-types": [
            "Usage:",
            "    tag-types                           Prints a summary of all the tags types in the library.",
            "    tag-types new                       Runs a wizard that creates a new tag type and adds it to the library.",
            "    tag-types info [name]               Prints all of the specified tag types's properties",
            "    tag-types search [property] <text>  Returns a list of tag types that contain the specified text within the specified property. Searchable properties include: name.",
            "    tag-types list                      Lists all the tag types in the library ten at a time. Enter \"p\" to view the previous ten or \"x\" to leave the command.",
            "    tag-types modify [name]             Modify the specified tag type's name and color.",
            "    tag-types remove [name]             Removes the specified tag type from the library.",
            "",
            "Shortcuts:",
            "    new         n",
            "    info        i",
            "    search      s",
            "    list        l",
            "    modify      m",
            "    remove      r"
        ]
    }
}